app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails"
---
  def index
    @emails = Email.all

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 3]]
---
  def destroy
    @email_delete = Email.find(params[:id])

    respond_to do |format|
    if @email_delete.destroy